# Selection Properties

---
The Selection type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
Selection Class
Autodesk.Revit.UI.Selection Namespace